Config/DataProcessors/ВыгрузкаОтчетностиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаОтчетностиОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыВыгрузкиБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЭкспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЭкспортаФайловОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийПериод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеПериодыПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтчетыДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зависимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсходныйОтчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВыбираемогоОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеДополнительныхОтборов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбранныйОтчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеЦифровыеПодписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомуВыданСертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Comment>Отпечаток сертификата</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановившийПодпись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата в формате xml</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертификатСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройкиФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчаниюХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СохраненноеЗначениеХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокВыбораХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапоминатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлыДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УниверсальныйРегламентированныйОтчетПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Enums/СостоянияОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписанСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробнаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказателиОтсутствуют</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыВыгрузкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменСФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрыватьВДереве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Флаг использования значения как выражения на встроенном языке</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ВыгрузкаОтчетностиОрганизаций/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ОтчетДляВыгрузки) Тогда 
		ПредложитьВыбратьОтчет = Истина;
		Возврат;
	КонецЕсли;
	
	ПрочитатьПараметры(Отказ);
	
	ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыгружаемыйОтчет,"ВидОтчета");
	
	ЗагрузитьНастройкиВыгрузкиОтчетов(Истина);
	
	УстановитьОграниченияНаФорматы();
	
	ФорматВыгрузкиПриИзмененииНаСервере(Истина);	
	
	УправлениеСтраницамиПараметровВыгрузки();
	УправлениеВидимостьюСтраницыЭЦП();
	ПроверитьВозможностьВыгрузки();

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПредложитьВыбратьОтчет Тогда 
		Отказ = Истина;
		
		ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентПереопределяемый.ДействиеПриОткрытииОбраоткуиВыгрузкиБезПараметров();
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Тогда 
		СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
		
		ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ДобавитьподписьВСтруктуру(СтруктураДанных,ВыбранноеЗначение);
		
		ДобавитьСертификаты(СтруктураДанных);
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьФорматаВыгрузкиБухгалтерскойОтчетности" Тогда
		УстановитьОграниченияНаФорматы();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииНастройкиФормата_Подключаемый(Элемент)
	
	// Если изменилось значение доп.настройки, нужно отразить это же изменение в таблице доп.настроек.
	ПриИзмененииНастройкиФорматаНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаНастройкиФормата_Подключаемый(Элемент, СтандартнаяОбработка)
	
	// Для элементов доп.настроек со списком выбора очистка не допускается. 
	Если Элемент.СписокВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматВыгрузкиПриИзменении(Элемент)
	
	ФорматВыгрузкиПриИзмененииНаСервере(Ложь);
	
	Если ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда
		ОповеститьОбИзменении(Объект.ФорматВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыгрузкиПриИзменении(Элемент)
	СпособВыгрузкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;                      
	ДополнительныеПараметры.Вставить("РежимРаботы",РежимДиалогаВыбораФайла.ВыборКаталога);
	ДополнительныеПараметры.Вставить("Каталог",Объект.ПутьВыгрузки);
	
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата", Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма, ДополнительныеПараметры));
	
	
	БюджетнаяОтчетностьКлиент.ВыбратьФайлСпростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФайлов

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыгружатьПриИзменении(Элемент)
	
	ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЭЦП(Команда)
	
	
	
	СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
	СтруктураДанных.ОписаниеПодписываемогоОбъекта = НСтр("ru = 'создаваемые пакеты'");
	СтруктураДанных.УидФормы = УникальныйИдентификатор;
	СтруктураДанных.РежимПредварительногоВыбораСертификатов = Истина;
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ВыбратьСертификатыДляПодписи(СтруктураДанных, ЭтаФорма);
	
	ДобавитьСертификаты(СтруктураДанных);

	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификаты(СтруктураДанных)
	
	Если СтруктураДанных.Отказ	Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого ВыбранныйСертификат Из СтруктураДанных.МассивОписанийСертификатов Цикл
		НоваяСтока = Объект.ЭлектронныеЦифровыеПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтока,ВыбранныйСертификат,"КомуВыданСертификат,Отпечаток,ДатаПодписи,Комментарий,УстановившийПодпись");
		Если ЗначениеЗаполнено(ВыбранныйСертификат.СертификатСсылка) Тогда 
			НоваяСтока.СертификатСсылка = ВыбранныйСертификат.СертификатСсылка;
		Иначе 
			НоваяСтока.Сертификат = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ВыбранныйСертификат.Сертификат);
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ОткрытьСертификат(Элементы.ЭлектронныеЦифровыеПодписи.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчеты(Команда)
	
	ПоместитьЗначенияНаСервере();
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ПрисоединенныеФайлыДляВыгрузки.Очистить();
		
	Для Каждого СтрТЧ Из ТаблицаФайлов Цикл
		Если СтрТЧ.Выгружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Объект.ПрисоединенныеФайлыДляВыгрузки.Добавить();
		НовСтр.Отчет = ВыгружаемыйОтчет;
		НовСтр.СсылкаНаПрисоединенныйФайл = СтрТЧ.Ссылка;
		
	КонецЦикла;
	
	СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруФормированияПакетов();
	СтруктураДанных.Обработка = Объект;
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработкаЗавершенияВыгрузки",ЭтаФорма,Неопределено);
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьПакеты(СтруктураДанных, ЭтаФорма, ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаПоФормату(Команда)
	
	СтруктураПараметов = Новый Структура;
	СтруктураПараметов.Вставить("Формат",Объект.ФорматВыгрузки);
	
	ОткрытьФорму("Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.Форма.ФормаСправки",СтруктураПараметов,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФайлов(Команда)
	ОбновитьСписокФайловНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ФорматВыгрузкиПриИзмененииНаСервере(ЗаполнениеНачальныхНастроек)
	
	ОбновитьНастройкиПредопределенныхФорматов();
	
	ЗагрузитьНастройкиСпособаВыгрузки(ЗаполнениеНачальныхНастроек);
	ЗагрузитьДополнительныеНастройкиФормата(ЗаполнениеНачальныхНастроек);
	
	УстановитьОграниченияНаСпособВыгрузки();
	
	УправлениеВидимостьюДопПараметров();
	УправлениеВидимостьюКнопкиСправки();
	
	ОбновитьНастройкиВыгрузкиПрисоединенныхФайлов();
	
КонецПроцедуры

&НаСервере
Процедура СпособВыгрузкиПриИзмененииНаСервере()
	
	УправлениеСтраницамиПараметровВыгрузки();
	УправлениеВидимостьюСтраницыЭЦП();
	ЗагрузитьНастройкиСпособаВыгрузки();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиПредопределенныхФорматов()
	
	ВыбранныйФормат = Объект.ФорматВыгрузки;
	Если ЗначениеЗаполнено(ВыбранныйФормат) И ВыбранныйФормат.Предопределенный Тогда
		Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ОбновитьНастройкиФорматов(ВыбранныйФормат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиВыгрузкиПрисоединенныхФайлов()
	
	ВозможнаВыгрузкаПрисоединенныхФайлов = Ложь;
	Если ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда
		ВозможнаВыгрузкаПрисоединенныхФайлов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ФорматВыгрузки,"ВозможнаВыгрузкаПрисоединенныхФайлов");
	КонецЕсли;
		
	Если ВозможнаВыгрузкаПрисоединенныхФайлов Тогда
		Элементы.Файлы.Видимость = Истина;
		ОбновитьСписокФайловНаСервере();
	Иначе
		ТаблицаФайлов.Очистить();
		Объект.ПрисоединенныеФайлыДляВыгрузки.Очистить();
		Элементы.Файлы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокФайловНаСервере()
	
	ТаблицаФайлов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(Файлы.ИндексКартинки, 2) КАК ИндексКартинки,
		|	Файлы.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
		|	Файлы.Автор КАК Автор,
		|	Файлы.ДатаСоздания КАК ДатаСоздания,
		|	Файлы.Изменил КАК Отредактировал,
		|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
		|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
		|	Файлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.УниверсальныйРегламентированныйОтчетПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ЭтоГруппа = ЛОЖЬ
		|	И Файлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВыгружаемыйОтчет);
	
	ДатаУниверсальная = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("СекундДоМестногоВремени",
		МестноеВремя(ДатаУниверсальная, ЧасовойПоясСеанса()) - ДатаУниверсальная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТаблицаФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодписьКоличестваФайлов(Форма)
	
	Перем Всего, Отмечено, СтрТЧ;
	
	Отмечено = 0;
	Всего = 0;
	Для Каждого СтрТЧ Из Форма.ТаблицаФайлов Цикл
		Если СтрТЧ.Выгружать Тогда
			Отмечено = Отмечено + 1;
		КонецЕсли;
		Всего = Всего + 1;
	КонецЦикла;
	Если Всего>0 Тогда
		Форма.КоличествоФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 из %2'"),Отмечено,Всего);
	Иначе
		Форма.КоличествоФайлов = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметры(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыгружаемыйОтчет = Параметры.ОтчетДляВыгрузки;
		
		ПредставлениеОтчета = БюджетнаяОтчетность.ПолучитьПредставлениеЭкземпляраОтчета(ВыгружаемыйОтчет, Истина, Истина, Истина); 
		
		Объект.ОтчетыДляВыгрузки.Очистить();
		НоваяСтрока = Объект.ОтчетыДляВыгрузки.Добавить();
		НоваяСтрока.Отчет = ВыгружаемыйОтчет;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда 
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ДополнительныеНастройкиФормата") Тогда
			
			ДанныеДляПервичногоЗаполненияЗначенийДопНастрек = Параметры.ЗначенияЗаполнения.ДополнительныеНастройкиФормата; 
			
			Параметры.ЗначенияЗаполнения.Удалить("ДополнительныеНастройкиФормата");
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
		
		МассивИсключений = Новый Массив;
		Для Каждого ЭлементЗначенийЗаполнения Из Параметры.ЗначенияЗаполнения Цикл 
			МассивИсключений.Добавить(ЭлементЗначенийЗаполнения.Ключ);
		КонецЦикла;	
		ИсключенияПриЗаполнении = СтрСоединить(МассивИсключений, ",");
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОграниченияНаФорматы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ПоддерживаемыеВидыОтчетов КАК ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов КАК ВидыОтчетов
	|		ПО ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.КодВидаОтчета = ВидыОтчетов.Код
	|ГДЕ
	|	ВидыОтчетов.Ссылка = &ВидОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФорматыВыгрузкиБухгалтерскойОтчетности.Ссылка
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности КАК ФорматыВыгрузкиБухгалтерскойОтчетности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ПоддерживаемыеВидыОтчетов КАК ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов
	|		ПО (ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.Ссылка = ФорматыВыгрузкиБухгалтерскойОтчетности.Ссылка)
	|ГДЕ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.Ссылка ЕСТЬ NULL ";
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивДоступныхФорматов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если МассивДоступныхФорматов.Количество() = 0 Тогда
		НетФорматовДляВыгрузки = Истина;
		Возврат;	
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Новый ФиксированныйМассив(МассивДоступныхФорматов)));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ВидОтчета",ВидОтчета));
	
	Элементы.ФорматВыгрузки.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Если МассивДоступныхФорматов.Найти(Объект.ФорматВыгрузки) = Неопределено Тогда 
		Объект.ФорматВыгрузки = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ПустаяСсылка();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьВозможностьВыгрузки()
	
	ВыгрузкаНевозможна = Ложь;
	НомерСтраницы = 0;
	СообщениеПоОтчету = "";
	
	Если НетФорматовДляВыгрузки Тогда
		НомерСтраницы = 2;
		ВыгрузкаНевозможна = Истина;
		СообщениеПоОтчету = НСтр("ru = ''Нет форматов для выгрузки данного отчета.''");
	Иначе
		РеквзитыОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыгружаемыйОтчет,"ПометкаУдаления,Состояние");
	    Если РеквзитыОтчета.ПометкаУдаления Тогда
	        НомерСтраницы = 2;
			ВыгрузкаНевозможна = Истина;
			СообщениеПоОтчету = НСтр("ru = 'Этот отчет помечен на удаление.'");
			Элементы.ДекорацияОшибкаРасширеннаяПодсказка.Заголовок = СообщениеПоОтчету;
		ИначеЕсли НЕ (РеквзитыОтчета.Состояние = Перечисления.СостоянияОтчетов.Подготовлен
			ИЛИ РеквзитыОтчета.Состояние = Перечисления.СостоянияОтчетов.Утвержден) Тогда
			НомерСтраницы = 1;
			ТестСообщения = НСтр("ru = 'Выбран отчет с состоянием ""%1"". Рекомендуется выгружать только отчеты в состоянии ""Подготовлен"", ""Утвержден"".'");
			СообщениеПоОтчету = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТестСообщения,РеквзитыОтчета.Состояние);
			Элементы.ДекорацияПредупреждениеРасширеннаяПодсказка.Заголовок = СообщениеПоОтчету;
		КонецЕсли;
	КонецЕсли;
		
	Элементы.ФормаВыгрузитьОтчет.Доступность = НЕ ВыгрузкаНевозможна;
	
	Если НомерСтраницы = 0 Тогда 
		Элементы.ГруппаСтраницыСообщения.Видимость = Ложь;
		
	ИначеЕсли НомерСтраницы = 1 Тогда 
		Элементы.ГруппаСтраницыСообщения.ТекущаяСтраница = Элементы.ГруппаСтраницаПредупреждение;
		
	ИначеЕсли НомерСтраницы = 2 Тогда
		Элементы.ГруппаСтраницыСообщения.ТекущаяСтраница = Элементы.ГруппаСтраницаОшибка;
		
	КонецЕсли;
	
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеСтраницамиПараметровВыгрузки()
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(Объект.СпособВыгрузки);
	
	Если ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.Каталог" Тогда 
		НужнаяСтаница = "ВыгрузкаВКаталог";
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда 
		НужнаяСтаница = "ВыгрузкаFTP";
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда 
		НужнаяСтаница = "ВыгрузкаЧерезEmail";

		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС" Тогда 
		НужнаяСтаница = "ВыгрузкаВФНС";
		
	Иначе
		НужнаяСтаница = "ВыгрузкаВКаталог";
		
	КонецЕсли;	
	
	БюджетнаяОтчетностьКлиентСервер.ПереключитьСтраницуИСкрытьОстальные(Элементы, "СтраницыПараметровВыгрузки", НужнаяСтаница); 
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеВидимостьюСтраницыЭЦП()
	
	
	Элементы.СтраницаНастройкиКриптографии.Видимость = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПоказыватьСтраницуЭЦП(Объект.СпособВыгрузки);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДопПараметров()
	
	Элементы.ГруппаДополнительныеНастройкиФорматаОбмена.Видимость = Объект.ДополнительныеНастройкиФормата.Количество() > 0;
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеВидимостьюКнопкиСправки()
	
	Элементы.КнопкаСправкаПоФормату.Видимость = ЗначениеЗаполнено(Объект.ФорматВыгрузки) и ЗначениеЗаполнено(Объект.ФорматВыгрузки.Справка);
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОграниченияНаСпособВыгрузки()
	
	Элементы.СпособВыгрузки.РежимВыбораИзСписка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФорматВыгрузки",Объект.ФорматВыгрузки);

	Запрос.УстановитьПараметр("ВебСервис",Перечисления.СпособыВыгрузкиФайлов.WebСервис);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпособыОтправки.СпособОтправки КАК СпособОтправки
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ПоддерживаемыеСпособыОтправки КАК СпособыОтправки
	|ГДЕ
	|	СпособыОтправки.Ссылка = &ФорматВыгрузки
	|	И СпособыОтправки.СпособОтправки <> &ВебСервис
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпособОтправки";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСпособов = Результат.Выгрузить().ВыгрузитьКолонку("СпособОтправки");
	
	Элементы.СпособВыгрузки.СписокВыбора.ЗагрузитьЗначения(МассивСпособов);
	Элементы.СпособВыгрузки.РежимВыбораИзСписка = Истина;
	
	Если МассивСпособов.Найти(Объект.СпособВыгрузки) = Неопределено Тогда 
		Объект.СпособВыгрузки = МассивСпособов[0];
		СпособВыгрузкиПриИзмененииНаСервере();
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВыгрузкиОтчетов(ИспользоватьИсключения = Ложь)
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗагрузитьОсновныеНастройкиВыгрузки(ИмяПользователя());
	Если ИспользоватьИсключения Тогда 
		УдалитьИсключенияИзСтруктуры(СтруктураНастроек);
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
	Иначе 
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура СохранитьНастройкиВыгрузкиОтчетов()
	
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	

	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПолучитьСтруктуруОсновныхНастроекВыгрузки();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек,Объект);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СохранитьОсновныеНастройкиВыгрузки(ИмяПользователя(),СтруктураНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьНастройкиСпособаВыгрузки(ИспользоватьИсключения = Ложь)
	
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	//Т.к. не во всех конфигурациях есть значение перечисления WebСервис, сравниваем со строкой
	Если Строка(Объект.СпособВыгрузки) = "Web-сервис" Тогда
		Объект.СпособВыгрузки = Неопределено;
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗагрузитьНастройкиСпособаВыгрузки(ИмяПользователя(),Объект.ФорматВыгрузки,Объект.СпособВыгрузки);
	Если ИспользоватьИсключения Тогда 
		УдалитьИсключенияИзСтруктуры(СтруктураНастроек);
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
	Иначе 
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСпособаВыгрузки()
	
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПолучитьСтруктуруНастроекСпособаВыгрузки(Объект.СпособВыгрузки);
	ЗаполнитьЗначенияСвойств(СтруктураНастроек,Объект);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СохранитьНастройкиСпособаВыгрузки(ИмяПользователя(),Объект.ФорматВыгрузки,Объект.СпособВыгрузки,СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДополнительныеНастройкиФормата(ЗаполнятьИзПервичныхДанных = Ложь)
	
	Если Объект.ФорматВыгрузки = ФорматТекущихДопНастроек Тогда 
		Возврат;
	КонецЕсли;	
	
	ФорматТекущихДопНастроек = Объект.ФорматВыгрузки;
	
	Объект.ДополнительныеНастройкиФормата.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаДополнительныхНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СформироватьТаблицуДополнительныхНастроек();
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗаполнитьТаблицуДополнительныхНастроек(Объект.ФорматВыгрузки,ТаблицаДополнительныхНастроек);
	
	Объект.ДополнительныеНастройкиФормата.Загрузить(ТаблицаДополнительныхНастроек);
	
	
	Если ЗаполнятьИзПервичныхДанных Тогда 
		
		ЗаполнитьДопНастройкиИзПервичныхДанных();

	КонецЕсли;
	
	СоздатьРеквизитыДопНастроек(ТаблицаДополнительныхНастроек);

КонецПроцедуры	

&НаСервере
Процедура СоздатьРеквизитыДопНастроек(ТаблицаДополнительныхНастроек)
	
	//Изменение реквизитов формы для дополнительных настроек.
	МассивИменДопРеквизитов = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого СтрокаДопНастройки Из ТаблицаДополнительныхНастроек Цикл
		
		// Новый дополнительный реквизит
		ИмяРеквизита = "ДопНастройка_"+СтрокаДопНастройки.Имя;

		МассивИменДопРеквизитов.Добавить(ИмяРеквизита);
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита,
													  СтрокаДопНастройки.ТипЗначения,
													  "",
													  СтрокаДопНастройки.Заголовок,
													  Истина));
		
	КонецЦикла;
	
	//Удаление ранее созданных реквизитов и элементов
	МассивУдаляемыхРеквизитов = Новый Массив;
	
	Если ТипЗнч(ДобавленныеЭлементы) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлМас Из ДобавленныеРеквизиты Цикл
			МассивУдаляемыхРеквизитов.Добавить(ЭлМас);
		КонецЦикла;
		Для Каждого ЭлМас Из ДобавленныеЭлементы Цикл
			ТекЭлемент = Элементы.Найти(ЭлМас);
			Если ТекЭлемент<>Неопределено Тогда
				Элементы.Удалить(ТекЭлемент);
			КонецЕсли;
		КонецЦикла;	    
	КонецЕсли;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,МассивУдаляемыхРеквизитов);
	ДобавленныеРеквизиты = Новый ФиксированныйМассив(МассивИменДопРеквизитов);
	
	МассивЭлементов = Новый Массив;
	ГруппаДопНастроек = Элементы.ГруппаДополнительныеНастройкиФорматаОбмена;
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	Для Каждого СтрокаДопНастройки Из ТаблицаДополнительныхНастроек Цикл
		
		//Если для поля предусмотрена группировка, создаем для него группу или помещаем в ранее созданную.
		ГруппаПолей = Неопределено;
		Если ЗначениеЗаполнено(СтрокаДопНастройки.ГруппаПолей) Тогда
			ИмяГруппыПолей = "ДопНастройка_"+СтрокаДопНастройки.ГруппаПолей;
			ГруппаПолей = Элементы.Найти(ИмяГруппыПолей);
			Если ГруппаПолей = Неопределено Тогда
				ГруппаПолей = Элементы.Добавить(ИмяГруппыПолей,Тип("ГруппаФормы"),ГруппаДопНастроек);
				ГруппаПолей.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПолей.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
				ГруппаПолей.ОтображатьЗаголовок = Истина;
				ГруппаПолей.Заголовок = БюджетнаяОтчетность.Синоним(СтрокаДопНастройки.ГруппаПолей);
				ГруппаПолей.Объединенная = Истина;
				ГруппаПолей.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				ГруппаПолей.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				МассивЭлементов.Добавить(ГруппаПолей.Имя);
			КонецЕсли;
		КонецЕсли;	
		
		ИмяРеквизита = "ДопНастройка_"+СтрокаДопНастройки.Имя;
		ТипПоля = Тип("ПолеФормы");
		Если СтрокаДопНастройки.ТипЗначения = ТипБулево Тогда
			ТипПоля = Тип("ПолеФлажкаФормы");
		КонецЕсли;
		
		НовЭлемент  = Элементы.Добавить(ИмяРеквизита,
										Тип("ПолеФормы"),
										?(ГруппаПолей = Неопределено, ГруппаДопНастроек, ГруппаПолей));
										
		НовЭлемент.ПутьКДанным = ИмяРеквизита;
		НовЭлемент.Заголовок = СтрокаДопНастройки.Заголовок;
		
		// Определяем тип поля
		Если СтрокаДопНастройки.ТипЗначения = ТипБулево Тогда
			НовЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Иначе
			НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовЭлемент.РастягиватьПоГоризонтали = Истина;
			НовЭлемент.УстановитьДействие("Очистка","ОчисткаНастройкиФормата_Подключаемый");
			Если СтрокаДопНастройки.СписокВыбора.Количество() > 0 Тогда
				НовЭлемент.РедактированиеТекста = Ложь;
				НовЭлемент.РежимВыбораИзСписка = Истина;
				Для Каждого ЭлементСписка Из СтрокаДопНастройки.СписокВыбора Цикл
					НовЭлемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
				КонецЦикла;
			Иначе
				НовЭлемент.КнопкаОчистки = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопНастройки.Описание) Тогда
			НовЭлемент.Подсказка = СтрокаДопНастройки.Описание;
			НовЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		КонецЕсли;
		
		// Заполяем сохраненные значения, или значения по умолчанию
		Если СтрокаДопНастройки.СохраненноеЗначение <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = СтрокаДопНастройки.СохраненноеЗначение;
		ИначеЕсли СтрокаДопНастройки.ЗначениеПоУмолчанию <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = СтрокаДопНастройки.ЗначениеПоУмолчанию;
		КонецЕсли;
				
		МассивЭлементов.Добавить(НовЭлемент.Имя);
		НовЭлемент.УстановитьДействие("ПриИзменении","ПриИзмененииНастройкиФормата_Подключаемый");
	КонецЦикла;

	ДобавленныеЭлементы = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНастройкиФорматаНаСервере(ИмяДопРеквизита)

	ИмяНастройки = СтрЗаменить(ИмяДопРеквизита,"ДопНастройка_", "");
	
	Отбор = Новый Структура("Имя", ИмяНастройки);
	СтрокиНастройки = Объект.ДополнительныеНастройкиФормата.НайтиСтроки(Отбор);
	Если СтрокиНастройки.Количество() > 0 Тогда
		СтрокиНастройки[0].Значение = ЭтотОбъект[ИмяДопРеквизита];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДополнительныеНастройкиФормата() 
	Если Не ЗначениеЗаполнено(Объект.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаДополнительныхНастроек = Объект.ДополнительныеНастройкиФормата.Выгрузить();
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗаписатьЗначенияТаблицыДополнительныхНастроекВРегистр(Объект.ФорматВыгрузки,ТаблицаДополнительныхНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьИсключенияИзСтруктуры(Структура)
	
	МассивИсключений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключенияПриЗаполнении,",");
	Для Каждого ПолеИсключение из МассивИсключений Цикл
		Если не Структура.Свойство(ПолеИсключение) Тогда 
			Продолжить;
		КонецЕсли;
		
		Структура.Удалить(ПолеИсключение);
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДопНастройкиИзПервичныхДанных()
	
	Если Не ЗначениеЗаполнено(ДанныеДляПервичногоЗаполненияЗначенийДопНастрек) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеПервичногоЗаполнения из ДанныеДляПервичногоЗаполненияЗначенийДопНастрек Цикл
		
		СтрокиДопНастроек = Объект.ДополнительныеНастройкиФормата.НайтиСтроки(Новый Структура("Имя",ДанныеПервичногоЗаполнения.Ключ));
		Для Каждого СтрокаДопНастройки из СтрокиДопНастроек Цикл 
			
			СтрокаДопНастройки.Значение = СтрокаДопНастройки.ТипЗначения.ПривестиЗначение(ДанныеПервичногоЗаполнения.Значение);
			СтрокаДопНастройки.ПредставлениеЗначения = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПолучитьПредставлениеЗначения(СтрокаДопНастройки);
			
		КонецЦикла;	
		
	КонецЦикла;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Объект.ПутьВыгрузки = Результат.ВыбранныеФайлы[0];
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаЗавершенияВыгрузки(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда 
		СохранитьПользовательскиеДанные();
	КонецЕсли;	
	
	ПрочитатьЗначенияНаСервере();
	
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли
	
КонецПроцедуры	

&НаСервере
Процедура СохранитьПользовательскиеДанные()
	
	СохранитьНастройкиВыгрузкиОтчетов();
	СохранитьНастройкиСпособаВыгрузки();
	СохранитьДополнительныеНастройкиФормата();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначенияНаСервере()
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПрочитатьЗначенияИзХранилища(Объект.ДополнительныеНастройкиФормата);
КонецПроцедуры

&НаСервере
Процедура ПоместитьЗначенияНаСервере()
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПоместитьЗначенияВХранилища(Объект.ДополнительныеНастройкиФормата);
КонецПроцедуры


#КонецОбласти

	







// Выгрузка отчетов
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
